import pytest
import pandas as pd
from pandas import DataFrame


@pytest.fixture
def sample_df() -> DataFrame:
    data = {
        "Дата операции": ["2022-01-10", "2022-01-15", "2022-01-20", "2022-01-25"],
        "Дата платежа": ["2022-01-10", "2022-01-15", "2022-01-20", "2022-01-25"],
        "Номер карты": ["1111****1111", "2222****2222", "1111****1111", "3333****3333"],
        "Сумма операции": [-1500, -2500, 3000, -500],
        "Сумма операции с округлением": [-1500, -2500, 3000, -500],
        "Кэшбэк": [0, 0, 0, 0],
        "Категория": ["Супермаркеты", "Фастфуд", "Пополнение_BANK007", "Наличные"],
        "Описание": ["Покупка", "Бургер", "Пополнение", "Снятие"],
    }
    df = pd.DataFrame(data)
    df["Дата операции"] = pd.to_datetime(df["Дата операции"])
    df["Дата платежа"] = pd.to_datetime(df["Дата платежа"])
    return pd.DataFrame(data)
